Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/lunyu__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 子曰：「臧武仲以防，求爲後於魯，雖曰不要君，吾不信也。」
en: The Master said, "Tsang Wu-chung, keeping possession of Fang, asked of the duke of Lu to appoint a successor to him in his family. Although it may be said that he was not using force with his sovereign, I believe he was."

source: 子曰：「晉文公譎而不正，齊桓公正而不譎。」
en: The Master said, "The duke Wan of Tsin was crafty and not upright. The duke Hwan of Ch'i was upright and not crafty."

source: 子路曰：「桓公殺公子糾，召忽死之，管仲不死。」曰：「未仁乎？」子曰：「桓公九合諸侯，不以兵車，管仲之力也。如其仁！如其仁！」
en: Tsze-lu said, "The Duke Hwan caused his brother Chiu to be killed, when Shao Hu died with his master, but Kwan Chung did not die. May not I say that he was wanting in virtue?" The Master said, "The Duke Hwan assembled all the princes together, and that not with weapons of war and chariots:—it was all through the influence of Kwan Chung. Whose beneficence was like his? Whose beneficence was like his?"

source: 子貢曰：「管仲非仁者與？桓公殺公子糾，不能死，又相之。」子曰：「管仲相桓公，霸諸侯，一匡天下，民到于今受其賜；微管仲，吾其被髮左衽矣！豈若匹夫匹婦之爲諒也，自經於溝瀆，而莫之知也！」
en: Tsze-kung said, "Kwan Chung, I apprehend, was wanting in virtue. When the Duke Hwan caused his brother Chiu to be killed, Kwan Chung was not able to die with him. Moreover, he became prime minister to Hwan." The Master said, "Kwan Chung acted as prime minister to the Duke Hwan, made him leader of all the princes, and united and rectified the whole kingdom. Down to the present day, the people enjoy the gifts which he conferred. But for Kwan Chung, we should now be wearing our hair unbound, and the lappets of our coats buttoning on the left side. "Will you require from him the small fidelity of common men and common women, who would commit suicide in a stream or ditch, no one knowing anything about them?"

source: 公叔文子之臣大夫僎，與文子同升諸公。子聞之曰：「可以爲文矣！」
en: The great officer, Hsien, who had been family-minister to Kung-shu Wan, ascended to the prince's court in company with Wan. The Master, having heard of it, said, "He deserved to be considered wan (the accomplished)."

source: 子言衞靈公之無道也。康子曰：「夫如是，奚而不喪？」孔子曰：「仲叔圉治賓客，祝鮀治宗廟，王孫賈治軍旅。夫如是，奚其喪？」
en: The Master was speaking about the unprincipled course of the duke Ling of Wei, when Ch'i K'ang said, "Since he is of such a character, how is it he does not lose his State?" Confucius said, "The Chung-shu Yu has the superintendence of his guests and of strangers; the litanist, T'o, has the management of his ancestral temple; and Wang-sun Chia has the direction of the army and forces:—with such officers as these, how should he lose his State?"

source: 子曰：「其言之不怍，則爲之也難！」
en: The Master said, "He who speaks without modesty will find it difficult to make his words good."

source: 陳成子弒簡公。孔子沐浴而朝，吿於哀公曰：「陳恆弒其君，請討之。」公曰：「吿夫三子。」孔子曰：「以吾從大夫之後，不敢不吿也！君曰：『吿夫三子』者！」之三子吿，不可。孔子曰：「以吾從大夫之後，不敢不吿也！」
en: Chan Ch'ang murdered the Duke Chien of Ch'i. Confucius bathed, went to court, and informed the duke Ai, saying, "Chan Hang has slain his sovereign. I beg that you will undertake to punish him." The duke said, "Inform the chiefs of the three families of it." Confucius retired, and said, "Following in the rear of the great officers, I did not dare not to represent such a matter, and my prince says, 'Inform the chiefs of the three families of it.'" He went to the chiefs, and informed them, but they would not act. Confucius then said, "Following in the rear of the great officers, I did not dare not to represent such a matter."

source: 子路問事君，子曰：「勿欺也，而犯之。」
en: Tsze-lu asked how a ruler should be served. The Master said, "Do not impose on him, and, moreover, withstand him to his face."

source: 子曰：「君子上達，小人下達。」
en: The Master said, "The progress of the superior man is upwards; the progress of the mean man is downwards."

source: 子曰：「古之學者爲己，今之學者爲人。」
en: The Master said, "In ancient times, men learned with a view to their own improvement. Now-a-days, men learn with a view to the approbation of others."

source: 蘧伯玉使人於孔子，孔子與之坐而問焉。曰：「夫子何爲？」對曰：「夫子欲寡其過而未能也。」使者出。子曰：「使乎！使乎！」
en: Chu Po-yu sent a messenger with friendly inquiries to Confucius. Confucius sat with him, and questioned him. "What," said he, "is your master engaged in?" The messenger replied, "My master is anxious to make his faults few, but he has not yet succeeded." He then went out, and the Master said, "A messenger indeed! A messenger indeed!"

source: 曾子曰：「君子思不出其位。」
en: The philosopher Tsang said, "The superior man, in his thoughts, does not go out of his place."

source: 子曰：「君子恥其言而過其行。」
en: The Master said, "The superior man is modest in his speech, but exceeds in his actions."

source: 子曰：「君子道者三，我無能焉：仁者不憂，知者不惑，勇者不懼。」子貢曰：「夫子自道也！」
en: The Master said, "The way of the superior man is threefold, but I am not equal to it. Virtuous, he is free from anxieties; wise, he is free from perplexities; bold, he is free from fear. Tsze-kung said, "Master, that is what you yourself say."

source: 子貢方人。子曰：「賜也，賢乎哉？夫我則不暇！」
en: Tsze-kung was in the habit of comparing men together. The Master said, "Tsze must have reached a high pitch of excellence! Now, I have not leisure for this."

source: 子曰：「不患人之不己知，患其不能也。」
en: The Master said, "I will not be concerned at men's not knowing me; I will be concerned at my own want of ability."

source: 子曰：「不逆詐，不億不信，抑亦先覺者，是賢乎！」
en: The Master said, "He who does not anticipate attempts to deceive him, nor think beforehand of his not being believed, and yet apprehends these things readily (when they occur);—is he not a man of superior worth?"

source: 微生畝謂孔子曰：「丘，何爲是栖栖者與？無乃爲佞乎？」孔子曰：「非敢爲佞也，疾固也。」
en: Wei-shang Mau said to Confucius, "Ch'iu, how is it that you keep roosting about? Is it not that you are an insinuating talker?" Confucius said, "I do not dare to play the part of such a talker, but I hate obstinacy."

source: 子曰：「驥不稱其力，稱其德也。」
en: The Master said, "A horse is called a ch'i, not because of its strength, but because of its other good qualities."

source: 或曰：「以德報怨，何如？」子曰：「何以報德？以直報怨，以德報德。」
en: Some one said, "What do you say concerning the principle that injury should be recompensed with kindness?" The Master said, "With what then will you recompense kindness? "Recompense injury with justice, and recompense kindness with kindness."

source: 子曰：「莫我知也夫！」子貢曰：「何爲其莫知子也？」子曰：「不怨天，不尤人，下學而上達，知我者，其天乎！」
en: The Master said, "Alas! there is no one that knows me." Tsze-kung said, "What do you mean by thus saying—that no one knows you?" The Master replied, "I do not murmur against Heaven. I do not grumble against men. My studies lie low, and my penetration rises high. But there is Heaven;—that knows me!"

source: 公伯寮愬子路於季孫，子服景伯以吿，曰：「夫子固有惑志於公伯寮，吾力猶能肆諸市朝。」子曰：「道之將行也與，命也；道之將廢也與，命也。公伯寮其如命何？」
en: The Kung-po Liao, having slandered Tsze-lu to Chi-sun, Tsze-fu Ching-po informed Confucius of it, saying, "Our master is certainly being led astray by the Kung-po Liao, but I have still power enough left to cut Liao off, and expose his corpse in the market and in the court." The Master said, "If my principles are to advance, it is so ordered. If they are to fall to the ground, it is so ordered. What can the Kung-po Liao do where such ordering is concerned?"

source: 子曰：「賢者辟世，其次辟地，其次辟色，其次辟言。」
en: The Master said, "Some men of worth retire from the world. Some retire from particular states. Some retire because of disrespectful looks. Some retire because of contradictory language."

source: 子曰：「作者七人矣。」
en: The Master said, "Those who have done this are seven men."

source: 子路宿於石門。晨門曰：「奚自？」子路曰：「自孔氏。」曰：「是知其不可而爲之者與？」
en: Tsze-lu happening to pass the night in Shih-man, the gatekeeper said to him, "Whom do you come from?" Tsze-lu said, "From Mr. K'ung." "It is he,—is it not?"—said the other, "who knows the impracticable nature of the times and yet will be doing in them."

source: 子擊磬於衞。有荷蕢者而過孔氏之門者，曰：「有心哉！擊磬乎！」既而曰：「鄙哉，硜硜乎！莫己知也，斯已而已矣！『深則厲，淺則揭。』」子曰：「果哉！末之難矣！」
en: The Master was playing, one day, on a musical stone in Wei, when a man, carrying a straw basket, passed the door of the house where Confucius was, and said, "His heart is full who so beats the musical stone." A little while after, he added, "How contemptible is the one-ideaed obstinacy those sounds display! When one is taken no notice of, he has simply at once to give over his wish for public employment. 'Deep water must be crossed with the clothes on; shallow water may be crossed with the clothes held up.'" The Master said, "How determined is he in his purpose! But this is not difficult!"

source: 子張曰：「書云：『高宗諒陰，三年不言。』何謂也？」子曰：「何必高宗，古之人皆然。君薨，百官總己以聽於冢宰，三年。」
en: Tsze-chang said, "What is meant when the Shu says that Kao-tsung, while observing the usual imperial mourning, was for three years without speaking?" The Master said, "Why must Kao-tsung be referred to as an example of this? The ancients all did so. When the sovereign died, the officers all attended to their several duties, taking instructions from the prime minister for three years."

source: 子曰：「上好禮，則民易使也。」
en: The Master said, "When rulers love to observe the rules of propriety, the people respond readily to the calls on them for service."

source: 子路問君子。子曰：「脩己以敬。」曰：「如斯而已乎？」曰：「脩己以安人。」曰：「如斯而已乎？」曰：「脩己以安百姓。脩己以安百姓，堯舜其猶病諸！」
en: Tsze-lu asked what constituted the superior man. The Master said, "The cultivation of himself in reverential carefulness." "And is this all?" said Tsze-lu. "He cultivates himself so as to give rest to others," was the reply. "And is this all?" again asked Tsze-lu. The Master said, "He cultivates himself so as to give rest to all the people. He cultivates himself so as to give rest to all the people:—even Yao and Shun were still solicitous about this."

source: 原壤夷俟。子曰：「幼而不孫弟，長而無述焉，老而不死，是爲賊。」以杖叩其脛。
en: Yuan Zang was squatting on his heels, and so waited the approach of the Master, who said to him, "In youth not humble as befits a junior; in manhood, doing nothing worthy of being handed down; and living on to old age:—this is to be a pest." With this he hit him on the shank with his staff.

source: 闕黨童子將命。或問之曰：「益者與？」子曰：「吾見其居於位也，見其與先生並行也，非求益者也，欲速成者也。」
en: A youth of the village of Ch'ueh was employed by Confucius to carry the messages between him and his visitors. Some one asked about him, saying, "I suppose he has made great progress." The Master said, "I observe that he is fond of occupying the seat of a full-grown man; I observe that he walks shoulder to shoulder with his elders. He is not one who is seeking to make progress in learning. He wishes quickly to become a man."

source: 衞靈公問陳於孔子。孔子對曰：「俎豆之事，則嘗聞之矣；軍旅之事，未之學也。」明日遂行。在陳絕糧。從者病，莫能興。子路慍見曰：「君子亦有窮乎？」子曰：「君子固窮，小人窮斯濫矣。」
en: The Duke Ling of Wei asked Confucius about tactics. Confucius replied, "I have heard all about sacrificial vessels, but I have not learned military matters." On this, he took his departure the next day. When he was in Chan, their provisions were exhausted, and his followers became so ill that they were unable to rise. Tsze-lu, with evident dissatisfaction, said, "Has the superior man likewise to endure in this way?" The Master said, "The superior man may indeed have to endure want, but the mean man, when he is in want, gives way to unbridled license."

source: 子曰：「賜也，女以予爲多學而識之者與？」對曰：「然，非與？」曰：「非也，予一以貫之。」
en: The Master said, "Ts'ze, you think, I suppose, that I am one who learns many things and keeps them in memory?" Tsze-kung replied, "Yes,—but perhaps it is not so?" "No," was the answer; "I seek a unity all-pervading."

source: 子曰：「由，知德者鮮矣！」
en: The Master said, "Yu, those who know virtue are few."

source: 子曰：「無爲而治者，其舜也與！夫何爲哉？恭己正南面而已矣。」
en: The Master said, "May not Shun be instanced as having governed efficiently without exertion? What did he do? He did nothing but gravely and reverently occupy his royal seat."

source: 子張問行。子曰：「言忠信，行篤敬，雖蠻貊之邦行矣。言不忠信，行不篤敬，雖州里行乎哉？立，則見其參於前也；在輿，則見其倚於衡也。夫然後行。」子張書諸紳。
en: Tsze-chang asked how a man should conduct himself, so as to be everywhere appreciated. The Master said, "Let his words be sincere and truthful, and his actions honourable and careful;—such conduct may be practised among the rude tribes of the South or the North. If his words be not sincere and truthful and his actions not honourable and careful, will he, with such conduct, be appreciated, even in his neighborhood? "When he is standing, let him see those two things, as it were, fronting him. When he is in a carriage, let him see them attached to the yoke. Then may he subsequently carry them into practice." Tsze-chang wrote these counsels on the end of his sash.

source: 子曰：「直哉史魚！邦有道，如矢；邦無道，如矢。君子哉蘧伯玉！邦有道，則仕；邦無道，則可卷而懷之。」
en: The Master said, "Truly straightforward was the historiographer Yu. When good government prevailed in his State, he was like an arrow. When bad government prevailed, he was like an arrow. A superior man indeed is Chu Po-yu! When good government prevails in his state, he is to be found in office. When bad government prevails, he can roll his principles up, and keep them in his breast."

source: 子曰：「可與言，而不與之言，失人；不可與言，而與之言，失言。知者不失人，亦不失言。」
en: The Master said, "When a man may be spoken with, not to speak to him is to err in reference to the man. When a man may not be spoken with, to speak to him is to err in reference to our words. The wise err neither in regard to their man nor to their words."

source: 子曰：「志士仁人，無求生以害仁，有殺身以成仁。」
en: The Master said, "The determined scholar and the man of virtue will not seek to live at the expense of injuring their virtue. They will even sacrifice their lives to preserve their virtue complete."

source: 子貢問爲仁。子曰：「工欲善其事，必先利其器。居是邦也，事其大夫之賢者，友其士之仁者。」
en: Tsze-kung asked about the practice of virtue. The Master said, "The mechanic, who wishes to do his work well, must first sharpen his tools. When you are living in any state, take service with the most worthy among its great officers, and make friends of the most virtuous among its scholars."

source: 顏淵問爲邦。子曰：「行夏之時，乘殷之輅，服周之冕，樂則韶舞。放鄭聲，遠佞人。鄭聲淫，佞人殆。」
en: Yen Yuan asked how the government of a country should be administered. The Master said, "Follow the seasons of Hsia. "Ride in the state carriage of Yin. "Wear the ceremonial cap of Chau. "Let the music be the Shao with its pantomimes. Banish the songs of Chang, and keep far from specious talkers. The songs of Chang are licentious; specious talkers are dangerous."

source: 子曰：「人無遠慮，必有近憂。」
en: The Master said, "If a man take no thought about what is distant, he will find sorrow near at hand."

source: 子曰：「已矣乎！吾未見好德如好色者也！」
en: The Master said, "It is all over! I have not seen one who loves virtue as he loves beauty."

source: 子曰：「臧文仲，其竊位者與！知柳下惠之賢，而不與立也。」
en: The Master said, "Was not Tsang Wan like one who had stolen his situation? He knew the virtue and the talents of Hui of Liu-hsia, and yet did not procure that he should stand with him in court."

source: 子曰：「躬自厚，而薄責於人，則遠怨矣！」
en: The Master said, "He who requires much from himself and little from others, will keep himself from being the object of resentment."

source: 子曰：「不曰『如之何，如之何』者，吾末如之何也已矣！」
en: The Master said, "When a man is not in the habit of saying—'What shall I think of this? What shall I think of this?' I can indeed do nothing with him!"

source: 子曰：「群居終日，言不及義，好行小慧，難矣哉！」
en: The Master said, "When a number of people are together, for a whole day, without their conversation turning on righteousness, and when they are fond of carrying out the suggestions of a small shrewdness;—theirs is indeed a hard case."

source: 子曰：「君子義以爲質，禮以行之，孫以出之，信以成之。君子哉！」
en: The Master said, "The superior man in everything considers righteousness to be essential. He performs it according to the rules of propriety. He brings it forth in humility. He completes it with sincerity. This is indeed a superior man."

source: 子曰：「君子病無能焉，不病人之不己知也。」
en: The Master said, "The superior man is distressed by his want of ability. He is not distressed by men's not knowing him."

source: 子曰：「君子疾沒世而名不稱焉。」
en: The Master said, "The superior man dislikes the thought of his name not being mentioned after his death."

source: 子曰：「君子求諸己，小人求諸人。」
en: The Master said, "What the superior man seeks, is in himself. What the mean man seeks, is in others."

source: 子曰：「君子矜而不爭，群而不黨。」
en: The Master said, "The superior man is dignified, but does not wrangle. He is sociable, but not a partizan."

source: 子曰：「君子不以言擧人，不以人廢言。」
en: The Master said, "The superior man does not promote a man simply on account of his words, nor does he put aside good words because of the man."

source: 子貢問曰：「有一言而可以終身行之者乎？」子曰：「其恕乎！己所不欲，勿施於人。」
en: Tsze-kung asked, saying, "Is there one word which may serve as a rule of practice for all one's life?" The Master said, "Is not reciprocity such a word? What you do not want done to yourself, do not do to others."

source: 子曰：「吾之於人也，誰毀誰譽？如有所譽者，其有所試矣。斯民也，三代之所以直道而行也。」
en: The Master said, "In my dealings with men, whose evil do I blame, whose goodness do I praise, beyond what is proper? If I do sometimes exceed in praise, there must be ground for it in my examination of the individual. "This people supplied the ground why the three dynasties pursued the path of straightforwardness."

source: 子曰：「吾猶及史之闕文也，有馬者，借人乘之。今亡矣夫！」
en: The Master said, "Even in my early days, a historiographer would leave a blank in his text, and he who had a horse would lend him to another to ride. Now, alas! there are no such things."

source: 子曰：「巧言亂德，小不忍，則亂大謀。」
en: The Master said, "Specious words confound virtue. Want of forbearance in small matters confounds great plans."

source: 子曰：「眾惡之，必察焉；眾好之，必察焉。」
en: The Master said, "When the multitude hate a man, it is necessary to examine into the case. When the multitude like a man, it is necessary to examine into the case."

source: 子曰：「人能弘道，非道弘人。」
en: The Master said, "A man can enlarge the principles which he follows; those principles do not enlarge the man."

source: 子曰：「過而不改，是謂過矣。」
en: The Master said, "To have faults and not to reform them,—this, indeed, should be pronounced having faults."

source: 子曰：「吾嘗終日不食，終夜不寑，以思；無益，不如學也。」
en: The Master said, "I have been the whole day without eating, and the whole night without sleeping:—occupied with thinking. It was of no use. The better plan is to learn."

source: 子曰：「君子謀道不謀食。耕也，餒在其中矣；學也，祿在其中矣。君子憂道不憂貧。」
en: The Master said, "The object of the superior man is truth. Food is not his object. There is plowing;—even in that there is sometimes want. So with learning;—emolument may be found in it. The superior man is anxious lest he should not get truth; he is not anxious lest poverty should come upon him."

source: 子曰：「知及之，仁不能守之，雖得之，必失之。知及之，仁能守之。不莊以蒞之，則民不敬。知及之，仁能守之，莊以蒞之。動之不以禮，未善也。」
en: The Master said, "When a man's knowledge is sufficient to attain, and his virtue is not sufficient to enable him to hold, whatever he may have gained, he will lose again. "When his knowledge is sufficient to attain, and he has virtue enough to hold fast, if he cannot govern with dignity, the people will not respect him. "When his knowledge is sufficient to attain, and he has virtue enough to hold fast; when he governs also with dignity, yet if he try to move the people contrary to the rules of propriety:—full excellence is not reached."

source: 子曰：「君子不可小知，而可大受也。小人不可大受，而可小知也。」
en: The Master said, "The superior man cannot be known in little matters; but he may be intrusted with great concerns. The small man may not be intrusted with great concerns, but he may be known in little matters."

source: 子曰：「民之於仁也，甚於水火。水火，吾見蹈而死者矣，未見蹈仁而死者也。」
en: The Master said, "Virtue is more to man than either water or fire. I have seen men die from treading on water and fire, but I have never seen a man die from treading the course of virtue."

source: 子曰：「當仁，不讓於師。」
en: The Master said, "Let every man consider virtue as what devolves on himself. He may not yield the performance of it even to his teacher."

source: 子曰：「君子貞而不諒。」
en: The Master said, "The superior man is correctly firm, and not firm merely."

source: 子曰：「事君，敬其事而後其食。」
en: The Master said, "A minister, in serving his prince, reverently discharges his duties, and makes his emolument a secondary consideration."

source: 子曰：「有教無類。」
en: The Master said, "In teaching there should be no distinction of classes."

source: 子曰：「道不同，不相爲謀。」
en: The Master said, "Those whose courses are different cannot lay plans for one another."

source: 子曰：「辭，達而已矣！」
en: The Master said, "In language it is simply required that it convey the meaning."

source: 師冕見。及階，子曰：「階也。」及席，子曰：「席也。」皆坐，子吿之曰：「某在斯，某在斯。」師冕出，子張問曰：「與師言之道與？」子曰：「然，固相師之道也。」
en: The Music-master, Mien, having called upon him, when they came to the steps, the Master said, "Here are the steps." When they came to the mat for the guest to sit upon, he said, "Here is the mat." When all were seated, the Master informed him, saying, "So and so is here; so and so is here." The Music-master, Mien, having gone out, Tsze-chang asked, saying. "Is it the rule to tell those things to the Music-master?" The Master said, "Yes. This is certainly the rule for those who lead the blind."

source: 季氏將伐顓臾。冉有季路見於孔子曰：「季氏將有事於顓臾。」孔子曰：「求！無乃爾是過與？夫顓臾，昔者先王以爲東蒙主，且在邦域之中矣，是社稷之臣也。何以伐爲？」冉有曰：「夫子欲之，吾二臣者，皆不欲也。」孔子曰：「求！周任有言曰：『陳力就列，不能者止。』危而不持，顚而不扶，則將焉用彼相矣？且爾言過矣！虎兕出於柙，龜玉毀於櫝中，是誰之過與？」冉有曰：「今夫顓臾，固而近於費；今不取，後世必爲子孫憂。」孔子曰：「求！君子疾夫舍曰欲之，而必爲之辭。丘也，聞有國有家者，不患寡而患不均，不患貧而患不安。蓋均無貧，和無寡，安無傾。夫如是，故遠人不服，則修文德以來之。既來之，則安之。今由與求也，相夫子，遠人不服而不能來也；邦分崩離析而不能守也，而謀動干戈於邦內。吾恐季孫之憂，不在顓臾，而在蕭牆之內也！」
en: The head of the Chi family was going to attack Chwan-yu. Zan Yu and Chi-lu had an interview with Confucius, and said, "Our chief, Chi, is going to commence operations against Chwan-yu." Confucius said, "Ch'iu, is it not you who are in fault here? "Now, in regard to Chwan-yu, long ago, a former king appointed its ruler to preside over the sacrifices to the eastern Mang; moreover, it is in the midst of the territory of our State; and its ruler is a minister in direct connexion with the sovereign:—What has your chief to do with attacking it?" Zan Yu said, "Our master wishes the thing; neither of us two ministers wishes it." Confucius said, "Ch'iu, there are the words of Chau Zan,—'When he can put forth his ability, he takes his place in the ranks of office; when he finds himself unable to do so, he retires from it. How can he be used as a guide to a blind man, who does not support him when tottering, nor raise him up when fallen?' "And further, you speak wrongly. When a tiger or rhinoceros escapes from his cage; when a tortoise or piece of jade is injured in its repository:—whose is the fault?" Zan Yu said, "But at present, Chwan-yu is strong and near to Pi; if our chief do not now take it, it will hereafter be a sorrow to his descendants." Confucius said. "Ch'iu, the superior man hates that declining to say—'I want such and such a thing,' and framing explanations for the conduct. "I have heard that rulers of States and chiefs of families are not troubled lest their people should be few, but are troubled lest they should not keep their several places; that they are not troubled with fears of poverty, but are troubled with fears of a want of contented repose among the people in their several places. For when the people keep their several places, there will be no poverty; when harmony prevails, there will be no scarcity of people; and when there is such a contented repose, there will be no rebellious upsettings. "So it is.—Therefore, if remoter people are not submissive, all the influences of civil culture and virtue are to be cultivated to attract them to be so; and when they have been so attracted, they must be made contented and tranquil. "Now, here are you, Yu and Ch'iu, assisting your chief. Remoter people are not submissive, and, with your help, he cannot attract them to him. In his own territory there are divisions and downfalls, leavings and separations, and, with your help, he cannot preserve it. "And yet he is planning these hostile movements within the State.—I am afraid that the sorrow of the Chi-sun family will not be on account of Chwan-yu, but will be found within the screen of their own court."
